---
layout: post
status: publish
published: true
title: Stand and Deliver
author:
  display_name: sepoy
  login: admin
  email: mananahmedasif@gmail.com
  url: ''
author_login: admin
author_email: mananahmedasif@gmail.com
wordpress_id: 241
wordpress_url: originalsitenamearchives/uncategorized/stand_and_deliver
date: '2004-11-16 10:26:51 -0500'
date_gmt: '2004-11-16 16:26:51 -0500'
categories:
- homistan
tags:
- homistan
comments:
- id: 1678
  author: Jonathan Dresner
  author_email: jdresner@earthlink.net
  author_url: http://www.chapatimystery.com/archives/2.html
  date: '2004-11-16 17:45:24 -0500'
  date_gmt: ''
  content: I want to see the text she prepared.
- id: 1679
  author: Chan'ad
  author_email: chanad@gmail.com
  author_url: http://chanad.tk
  date: '2004-11-17 10:11:22 -0500'
  date_gmt: ''
  content: Yeah, when I read about this in the local papers a few days back I immediately
    recalled Asra Nomani's "Take back your mosque" movement. But there aren't enough
    details about this story yet. I'm still trying get to the bottom and find out
    what the actual deal is. Interesting.
- id: 1680
  author: Dan
  author_email: dan@dan.com
  author_url: ''
  date: '2004-11-26 01:30:11 -0500'
  date_gmt: ''
  content: Perhaps you should check Asra Nomani's credentials before supporting her
    cause. I for one do not think I want to be one of those rallying behind a woman
    who wants to lead a prayer along with her illegitimate son.
- id: 1681
  author: sepoy
  author_email: hk2K@HK.COM
  author_url: ''
  date: '2004-11-26 11:43:17 -0500'
  date_gmt: ''
  content: 'Dan: You are more than welcome not to support her cause, just as she is
    more than entitled to promote it. And I have the right to withhold my judgement
    on anyone besides myself.'
---
<div class=quote><img src="/img/startquote.gif">JEDDAH, 15 November 2004 &acirc; Police in Bahrain arrested a woman on Friday for disguising herself as a man and trying to deliver the Friday sermon at one of the largest mosques in the island state, Asharq Al-Awsat reported yesterday. &acirc;&circ;&scaron;&Acirc;&uml;The 40-year-old woman, who had put on an artificial beard and mustache and was wearing full male dress, took her place in the first row of the mosque packed with 7,000 worshippers, and intended to deliver the sermon before the prayer,&acirc;&circ;&scaron;&Atilde;&dagger; the paper said quoting Sheikh Adnan Al-Qattan, the mosque&acirc;&circ;&scaron;&acirc;&permil;&nbsp;s imam. The people who had assembled there for prayer did not take long to discover that the new &acirc;&circ;&scaron;&Acirc;&uml;imam&acirc;&circ;&scaron;&Atilde;&dagger; was a woman and stopped her from climbing the &acirc;&circ;&scaron;&Acirc;&uml;mimber&acirc;&circ;&scaron;&Atilde;&dagger; or podium used by the imam to deliver the sermon. The woman is now under detention at Houra police station. One of the worshippers prevented the &acirc;&circ;&scaron;&Acirc;&uml;imam&acirc;&circ;&scaron;&Atilde;&dagger; from getting into the mimber. &acirc;&circ;&scaron;&Acirc;&uml;In the ensuing jostle, the woman&acirc;&circ;&scaron;&acirc;&permil;&nbsp;s beard fell off and this revealed her gender,&acirc;&circ;&scaron;&Atilde;&dagger; Qattan said. The woman was so powerful that four men could not control her. Finally, the worshippers overpowered her and handed her over to police. &acirc;&circ;&scaron;&Acirc;&uml;The woman had prepared a sermon to deliver at the mosque,&acirc;&circ;&scaron;&Atilde;&dagger; the imam added.<img src="/img/endquote.gif"></div>
<p><a href="http://www.arabnews.com/?page=1&section=0&article=54523&d=15&m=11&y=2004&pix=kingdom.jpg&category=Kingdom">Go Girl</a>. Some news reports are saying she was mentally unstable. If so, can a sane woman please stand and deliver? A while back there was a rights of women in mosque email going around, anyone has a link to it? I am too busy to hunt that down. </p>
<p>Ah. Zack always has the <a href="http://www.chapatimystery.com/archives/000908.html">goods</a>.</p>
