---
layout: post
status: publish
published: true
title: Million Google Scholars
author:
  display_name: sepoy
  login: admin
  email: mananahmedasif@gmail.com
  url: ''
author_login: admin
author_email: mananahmedasif@gmail.com
wordpress_id: 790
wordpress_url: originalsitenamearchives/uncategorized/million_google_scholars
date: '2006-09-06 07:33:45 -0400'
date_gmt: '2006-09-06 13:33:45 -0400'
categories:
- wizbango! tech
tags:
- wizbango! tech
comments:
- id: 5783
  author: sven
  author_email: sven@gmail.com
  author_url: ''
  date: '2006-09-06 08:15:51 -0400'
  date_gmt: '2006-09-06 14:15:51 -0400'
  content: |-
    total.



    GOOGLE.



    domination.
- id: 5784
  author: archivo Google at Tapera
  author_email: ''
  author_url: http://www.tapera.info/?p=31
  date: '2006-09-06 08:35:33 -0400'
  date_gmt: '2006-09-06 14:35:33 -0400'
  content: '[...] chapati mystery adviriti&acirc;&circ;&scaron;&ldquo;
    hoy sobre la exang&acirc;&circ;&scaron;&Acirc;&ordm;e existencia en la secci&acirc;&circ;&scaron;&ldquo;n
    News de Google de una b&acirc;&circ;&scaron;&acirc;&circ;&laquo;squeda en archivos
    hist&acirc;&circ;&scaron;&ldquo;ricos. La fiebre de la megaempresa
    por escanear en grandes cantidades le permite introducir esta novedad en su tienda.
    El post de chapati&#8230; sostiene que al buscar informaci&acirc;&circ;&scaron;&ldquo;n
    sobre "India" en el nuevo instrumento no obtuvo mucho: ni siquiera tras las cortinas
    de las subscripciones pagas. Hice b&acirc;&circ;&scaron;&acirc;&circ;&laquo;squedas
    sobre dos o tres temas de historia argentina (en ingl&acirc;&circ;&scaron;&Acirc;&copy;s:
    ni Google se anima con los archivos locales) y no hay caso. Dos o tres notas del
    New York Times (consult&acirc;&circ;&scaron;&Acirc;&copy; esos arhivos y la informaci&acirc;&circ;&scaron;&ldquo;n
    no es escasa), bajo el dominio de Proquest, la empresa que vende el servicio de
    consulta online del diario; dos o tres notas de revistas; alg&acirc;&circ;&scaron;&acirc;&circ;&laquo;n
    art&acirc;&circ;&scaron;&acirc;&permil;&nbsp;culo m&acirc;&circ;&scaron;&Acirc;&deg;s
    cercano en el tiempo. chapati&#8230; indicaba que Google s&acirc;&circ;&scaron;&ldquo;lo
    tiene eficacia cuando se dirige a p&acirc;&circ;&scaron;&acirc;&circ;&laquo;blicos
    no acad&acirc;&circ;&scaron;&Acirc;&copy;micos, mientras que para quienes trabajan
    de eso &acirc;&circ;&scaron;&acirc;&circ;&laquo;ltimo tiene poco para ofrecer.
    Creo que la disyuntiva es desafortunada: en este blog venimos discutiendo sobre
    la posibilidad de producir conocimiento escapando de la "autoridad" universitaria
    ("escapando" es el t&acirc;&circ;&scaron;&Acirc;&copy;rmino lamentablemente: no
    es "afuera" y no es "desconociendo" o "ignorando") y para eso, adem&acirc;&circ;&scaron;&Acirc;&deg;s
    de las herramientas al servicio de las comunidades y de las que permiten la interacci&acirc;&circ;&scaron;&ldquo;n
    entre distintos grupos (incluso bajo un pidgin english cada m&acirc;&circ;&scaron;&Acirc;&deg;s
    errabundo), existe Google. Si la informaci&acirc;&circ;&scaron;&ldquo;n
    se anuncia como vasta, gal&acirc;&circ;&scaron;&Acirc;&deg;ctica, y durante (mucho)
    tiempo se presentan una docena de documentos escaneados, aislados de sus contextos
    de producci&acirc;&circ;&scaron;&ldquo;n, recepci&acirc;&circ;&scaron;&ldquo;n
    y archivo, entonces Google hace lo siguiente: prefigura los espacios hist&acirc;&circ;&scaron;&ldquo;ricos
    (que son los de la lectura de "restos" del pasado) como plausibles de ser "llenados",
    de ser minuciosamente escaneados y, luego, a esos espacios que llama "revisados"
    los compone de unas pocas voces, unos pocos escritos. Pero no, dir&acirc;&circ;&scaron;&Acirc;&deg;n
    algunos, est&acirc;&circ;&scaron;&Acirc;&deg;n las im&acirc;&circ;&scaron;&Acirc;&deg;genes!  Tags
    -----> Historia,Historia Digital,documentos,google news archive search,archivo,documentaci&acirc;&circ;&scaron;&ldquo;n,digitalizaci&acirc;&circ;&scaron;&ldquo;n  &raquo;
    Archivado en Historia, Historia Digital, documentos por nquiroga a las 11:32.  arriba
    [...]'
- id: 5785
  author: Andrew Reeves
  author_email: AndrewSshi@gmail.com
  author_url: http://www.schizmatic.blogspot.com
  date: '2006-09-06 18:05:46 -0400'
  date_gmt: '2006-09-07 00:05:46 -0400'
  content: |-
    I think that in the end, most of the historical heavy lifting is still going to be done by academics for the simple fact that they face career pressure to produce works of scholarship that necessitate actually crawling through all of the available material.



    "Barnes and Noble historians" may have more plentiful material to work with, but their quality probably won't improve noticably, given that their weaknesses tend to lie elsewhere than the availability of sources.
---
<p>A few weeks ago, Google announced that one can <a href="http://googleblog.blogspot.com/2006/08/download-classics.html">download pdfs</a> of public domain books from Google Print. Today comes another announcement about the availability of <a href="http://money.cnn.com/2006/09/06/technology/bc.media.google.history.reut/index.htm?cnn=yes">newspapers archives from 1700 to the present</a>. Most of the stuff that I <a href="http://news.google.com/archivesearch?q=India&num=10&as_ldate=1700&as_hdate=1900&sa=N&lnav=m">looked</a> for in the archives was behind subscription walls but no matter.</p>
<p>Academics have always had these archives and the search tools that allow us to do our trade. However, these Google tools are really a revolution outside the academy. It allows <i>easy public</i> access to the archive [the millions book scanned - and now, the million newspapers scanned]. </p>
<p>What that means for us? We oughta think about it.</p>
<p>ps. On the Google Print front, I should tell all the SAists that there is incredible material available. Search by time, rather than by keywords.</p>
